src/cf/DataProcessors/МаркетплейсOzon.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МаркетплейсOzon</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ЗаказыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыТорговыхПлощадок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлановойОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРодительскогоОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСкладаТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнениеСведенийПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПолучениеЭтикеток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияПолученияЭтикеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПунктеВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/МаркетплейсOzon/Forms/СоставЗаказа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись           = Параметры.УчетнаяЗапись;
	ЭтоFBO                  = Параметры.ЭтоFBO;
	ИдентификаторЗаказа     = Параметры.ИдентификаторЗаказа;
	НомерЗаказа             = Параметры.НомерЗаказа;
	КомментарийКЗаказу      = Параметры.КомментарийКЗаказу;
	ДатаСозданияОтправления = Параметры.ДатаСозданияОтправления;
	НомерОтправления        = Параметры.НомерОтправления;
	СтатусОтправления       = Параметры.СтатусОтправления;
	ДатаСборки              = Параметры.ДатаСборки;
	ДатаПередачиВДоставку   = Параметры.ДатаПередачиВДоставку;
	СпособДоставки          = Параметры.СпособДоставки;
	ТипДоставки             = Параметры.ТипДоставки;
	СпособОплаты            = Параметры.СпособОплаты;
	ПричинаОтмены           = Параметры.ПричинаОтмены;
	НаименованиеСклада      = Параметры.НаименованиеСклада;
	ТрекНомерОтправления    = Параметры.ТрекНомерОтправления;
	ДокументЗаказа          = Параметры.ДокументЗаказа;
	ДокументОтгрузки        = Параметры.ДокументОтгрузки;
	
	ДанныеОГеографииДоставки = Новый Массив;
	Если ЗначениеЗаполнено(Параметры.ГородДоставки) Тогда
		ДанныеОГеографииДоставки.Добавить(Параметры.ГородДоставки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.РегионДоставки) Тогда
		ДанныеОГеографииДоставки.Добавить(Параметры.РегионДоставки);
	КонецЕсли;
	ГеографияДоставки = СтрСоединить(ДанныеОГеографииДоставки, ", ");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сведения об отправлении <%1> по заказу <%2>'"),
		НомерОтправления,
		НомерЗаказа);
	
	Товары = ПолучитьИзВременногоХранилища(Параметры.АдресСодержимогоЗаказа);
	УдалитьИзВременногоХранилища(Параметры.АдресСодержимогоЗаказа);
	ЗначениеВРеквизитФормы(Товары, "СписокТоваровВОтправлении");
	
	ОбновитьТекстДокументыНаОсновании();
	
	Элементы.ГруппаРеквизитыFBO.Видимость    = ЭтоFBO;
	Элементы.ГруппаРеквизитыFBS.Видимость    = Не ЭтоFBO;
	Элементы.ГруппаДокументы.Видимость       = Не ЭтоFBO;
	Элементы.ГруппаДанныеОЗаказе.Видимость   = Не ЭтоFBO;
	Элементы.ГруппаКоманднаяПанель.Видимость = Не ЭтоFBO;
	
	Если Не ЭтоFBO Тогда
		Если СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки
				Или СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке Тогда
			Элементы.ДатаСборки.Видимость            = Истина;
			Элементы.ДатаПередачиВДоставку.Видимость = Ложь;
			Элементы.ПричинаОтмены.Видимость         = Ложь;
			Элементы.ТрекНомерОтправления.Видимость  = Ложь;
		ИначеЕсли СтатусОтправления = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен Тогда
			Элементы.ДатаСборки.Видимость            = Ложь;
			Элементы.ДатаПередачиВДоставку.Видимость = Ложь;
			Элементы.ПричинаОтмены.Видимость         = Истина;
			Элементы.ТрекНомерОтправления.Видимость  = Ложь;
		Иначе
			Элементы.ДатаСборки.Видимость            = Ложь;
			Элементы.ДатаПередачиВДоставку.Видимость = Истина;
			Элементы.ПричинаОтмены.Видимость         = Ложь;
			Элементы.ТрекНомерОтправления.Видимость  = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ВыполненаЗагрузкаЗаказовТорговойПлощадки"
				Или ИмяСобытия = "ВыполненаОтменаСборкиЗаказовНаТорговойПлощадке"
				Или ИмяСобытия = "ВыполненоПодтверждениеСборкиЗаказовНаТорговойПлощадке")
			И Не ЭтоFBO
			И Параметр = УчетнаяЗапись Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		УправлениеВидимостьюДоступностью();
	ИначеЕсли (ИмяСобытия = "МП_ОбновлениеСведенийПоЗаказамИОтправлениям"
					Или ИмяСобытия = "Запись_ЗаказКлиента"
					Или ИмяСобытия = "Запись_РеализацияТоваровУслуг"
					Или ИмяСобытия = "Запись_ПередачаТоваровХранителю")
				И Не ЭтоFBO Тогда
		ОпределитьДокументыFBS();
		ОбновитьТекстДокументыНаОсновании();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И (Источник = "ИспользоватьЗаказыКлиентов"
					Или Источник = "ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		УправлениеВидимостьюДоступностью();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстДокументыНаОснованииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьЗаказ" Тогда
		ПоказатьЗначение(Неопределено, ДокументЗаказа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументЗаказаПриИзменении(Элемент)
	
	ОбновитьТекстДокументыНаОсновании();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОтгрузкиПриИзменении(Элемент)
	
	ОбновитьТекстДокументыНаОсновании();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.ЗагрузитьЗаказы.Видимость = Не ЗначениеЗаполнено(ДокументЗаказа);
	Элементы.ЗагрузитьЗаказыПовторно.Видимость = ЗначениеЗаполнено(ДокументЗаказа);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстДокументыНаОсновании()
	
	Если ЭтоFBO Тогда
		Возврат;
	КонецЕсли;
	
	ТекстыПоляДокументыНаОсновании.Очистить();
	
	// Заказ
	ЕстьПравоИнтерактивногоДобавления = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ЗаказПокупателя);
	
	ЕстьЗаказ = ЗначениеЗаполнено(ДокументЗаказа);
	
	НавигационнаяСсылка = "";
	ТекстДокумента = "";
	
	Если Не ЕстьЗаказ И ЕстьПравоИнтерактивногоДобавления Тогда
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаЗагрузитьЗаказ;
	ИначеЕсли Не ЕстьЗаказ Тогда
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаТекст;
		ТекстДокумента = НСтр("ru = 'Заказ не загружен'");
	Иначе
		Элементы.ГруппаДанныеОЗаказе.ТекущаяСтраница = Элементы.СтраницаТекст;
		НавигационнаяСсылка = "ОткрытьЗаказ";
		РеквизитыЗаказа     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗаказа, "Номер, Дата");
		ТекстДокумента      = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заказ клиента № %1 от %2'"),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыЗаказа.Номер),
			Формат(РеквизитыЗаказа.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	Иначе
		ЦветТекста = Неопределено;
	КонецЕсли;
	
	ПредставлениеДокумента = Новый ФорматированнаяСтрока(ТекстДокумента,, ЦветТекста,, НавигационнаяСсылка);
	ТекстыПоляДокументыНаОсновании.Добавить(ПредставлениеДокумента);
	
	ОбновитьТекстДокументыНаОснованииФорматированнаяСтрока(ЭтотОбъект);
	
КонецПроцедуры

// Обновляет форматированную строку работы с документами на основании в форме документа
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - в форме должены быть реквизиты:
// 		* ТекстДокументыНаОсновании - ФорматированнаяСтрока - реквизит должен быть размещен в элеменете с именем ТекстДокументыНаОсновании 
// 		* ТекстыПоляДокументыНаОсновании - СписокЗначений Из ФорматированнаяСтрока - сформированные механизмами конфигурации форматированные строки документов, вводимых на основании 
// 
&НаСервере
Процедура ОбновитьТекстДокументыНаОснованииФорматированнаяСтрока(Форма)
	
	Отступ =  Новый ФорматированнаяСтрока("  ");
	ТекстыДокументыНаОсновании  = Новый Массив;
	
	Счетчик = 1;
	
	Для Каждого СтрМас Из Форма.ТекстыПоляДокументыНаОсновании Цикл
		
		Если Не ПустаяСтрока(Строка(СтрМас.Значение)) Тогда
			Если Счетчик > 1 Тогда
				ТекстыДокументыНаОсновании.Добавить(Отступ);
			КонецЕсли;				
			ТекстыДокументыНаОсновании.Добавить(СтрМас.Значение);
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекстыДокументыНаОсновании.Количество() > 0 Тогда
		Форма.Элементы.ТекстДокументыНаОсновании.Видимость = Истина;
		Форма.ТекстДокументыНаОсновании = Новый ФорматированнаяСтрока(ТекстыДокументыНаОсновании);
	Иначе
		Форма.Элементы.ТекстДокументыНаОсновании.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДокументыFBS()
	
	ДокументЗаказа   = Документы.ЗаказПокупателя.ПустаяСсылка();
	ДокументОтгрузки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыТорговыхПлощадок.НомерЗаказа КАК НомерЗаказа,
		|	ЗаказыТорговыхПлощадок.НомерОтправления КАК НомерОтправления,
		|	ЗаказыТорговыхПлощадок.Заказ КАК Заказ,
		|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ИСТИНА) КАК ЗаказКлиентаПометкаУдаления,
		|	ЗаказыТорговыхПлощадок.ДокументОтгрузки КАК ДокументОтгрузки
		|ИЗ
		|	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ДокументЗаказКлиента
		|		ПО ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись
		|	И ЗаказыТорговыхПлощадок.НомерЗаказа = &НомерЗаказа
		|	И ЗаказыТорговыхПлощадок.НомерОтправления = &НомерОтправления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказыТорговыхПлощадок.НомерЗаказа,
		|	ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления,
		|	ЗаказыТорговыхПлощадок.Заказ,
		|	ЕСТЬNULL(ДокументЗаказКлиента.ПометкаУдаления, ИСТИНА),
		|	ЗаказыТорговыхПлощадок.ДокументОтгрузки
		|ИЗ
		|	РегистрСведений.ЗаказыТорговыхПлощадок КАК ЗаказыТорговыхПлощадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ДокументЗаказКлиента
		|		ПО ЗаказыТорговыхПлощадок.Заказ = ДокументЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказыТорговыхПлощадок.УчетнаяЗапись = &УчетнаяЗапись
		|	И ЗаказыТорговыхПлощадок.НомерЗаказа = &НомерЗаказа
		|	И ЗаказыТорговыхПлощадок.НомерРодительскогоОтправления = &НомерОтправления";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись",    УчетнаяЗапись);
	Запрос.УстановитьПараметр("НомерЗаказа",      НомерЗаказа);
	Запрос.УстановитьПараметр("НомерОтправления", НомерОтправления);
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		Если Не ВыборкаДанных.ЗаказКлиентаПометкаУдаления Тогда
			ДокументЗаказа = ВыборкаДанных.Заказ;
			Если ЗначениеЗаполнено(ВыборкаДанных.ДокументОтгрузки) Тогда
				Если ТипЗнч(ДокументОтгрузки) = Тип("СписокЗначений") Тогда
					ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
				ИначеЕсли ЗначениеЗаполнено(ДокументОтгрузки) Тогда
					ПервыйДокументОтгрузки = ДокументОтгрузки;
					ДокументОтгрузки = Новый СписокЗначений;
					ДокументОтгрузки.Добавить(ПервыйДокументОтгрузки);
					ДокументОтгрузки.Добавить(ВыборкаДанных.ДокументОтгрузки);
				Иначе
					ДокументОтгрузки = ВыборкаДанных.ДокументОтгрузки;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ДокументЗаказа   = Документы.ЗаказПокупателя.ПустаяСсылка();
			ДокументОтгрузки = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
